Project/Toir/src/Documents/торо_ПринятиеОРКУчету/торо_ПринятиеОРКУчету.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ПринятиеОРКУчету</name>
  <registerRecords>InformationRegister.торо_СтатусыОбъектовРемонтаВУчете</registerRecords>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекСтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходитВСостав</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПодчиненныхПринятыхКУчету</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПринятьКУчету</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Documents/торо_ПринятиеОРКУчету/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
//
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ПринятиеОРКУчету";
	КомандаПечати.Идентификатор = "ПринятиеОРКУчету";
	КомандаПечати.Представление = НСтр("es='La aceptación del objeto de la reparación al recuento';ru='Принятие объекта ремонта к учету';en='Acceptance of the repair object for accounting'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПринятиеОРКУчету") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ПринятиеОРКУчету", 
		"Принятие объекта ремонта к учету", 
		ПечатьДокументаПринятиеОРКУчету(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_ПринятиеОРКУчету.ПФ_MXL_ПринятиеОРКУчету");
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьДокументаПринятиеОРКУчету(МассивОбъектов, ПараметрыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ПринятиеОРКУчету.ПФ_MXL_ПринятиеОРКУчету");
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	торо_ПринятиеОРКУчету.Ссылка КАК Документ,
	                |	торо_ПринятиеОРКУчету.Номер КАК Номер,
	                |	торо_ПринятиеОРКУчету.Дата КАК Дата,
	                |	торо_ПринятиеОРКУчету.ОбъектРемонта КАК ОбъектРемонта,
	                |	торо_ПринятиеОРКУчету.ОбъектРемонта.ИнвентарныйНомер КАК ИнвентарныйНомер,
	                |	торо_ПринятиеОРКУчету.Организация КАК Организация,
	                |	торо_ПринятиеОРКУчету.Подразделение КАК Подразделение,
	                |	торо_ПринятиеОРКУчету.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	                |	торо_ПринятиеОРКУчету.ВходитВСостав КАК ВходитВСостав,
	                |	торо_ПринятиеОРКУчету.Проведен КАК Проведен 
	                |ИЗ
	                |	Документ.торо_ПринятиеОРКУчету КАК торо_ПринятиеОРКУчету
	                |ГДЕ
	                |	торо_ПринятиеОРКУчету.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Организация = ВыборкаДокументов.Организация;
		ОбластьМакета.Параметры.Подразделение = ВыборкаДокументов.Подразделение;
		ОбластьМакета.Параметры.Номер = ВыборкаДокументов.Номер;
		ОбластьМакета.Параметры.Дата = ВыборкаДокументов.Дата;
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбщиеСведения");
		ОбластьМакета.Параметры.ОбъектРемонта = ВыборкаДокументов.ОбъектРемонта;
		ОбластьМакета.Параметры.ИнвентарныйНомер = ВыборкаДокументов.ИнвентарныйНомер;
		ОбластьМакета.Параметры.ДатаВвода = ВыборкаДокументов.ДатаВводаВЭксплуатацию;
		ОбластьМакета.Параметры.Иерархия = ПреобразоватьСтрокуИерархии(ВыборкаДокументов.ВходитВСостав);
		ТабДокумент.Вывести(ОбластьМакета);
		
		ВывестиКомиссию(ВыборкаДокументов.Документ, Макет, ТабДокумент);
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
	ТабДокумент.ТолькоПросмотр = Истина;
	Возврат ТабДокумент;
	
КонецФункции

Функция ПреобразоватьСтрокуИерархии(ИсходныеСтроки)
	
	МассивСтрок = СтрРазделить(ИсходныеСтроки, Символы.ПС);
	Индекс = 0;
	СтрокаИерархии= "";
	Для каждого Стр Из МассивСтрок Цикл
		СтрокаИерархии = СтрокаИерархии + Сред(Стр, Индекс*4 + 1) + " - ";
		Индекс = Индекс + 1;
	КонецЦикла;
	СтрокаИерархии = Лев(СтрокаИерархии, СтрДлина(СтрокаИерархии) - 3);
	
	Возврат СтрокаИерархии;
	
КонецФункции

Процедура ВывестиКомиссию(СсылкаНаДокумент, Макет, ТабДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	                |	торо_ПринятиеОРКУчетуСотрудники.Сотрудник КАК Сотрудник
	                |ИЗ
	                |	Документ.торо_ПринятиеОРКУчету.Сотрудники КАК торо_ПринятиеОРКУчетуСотрудники
	                |ГДЕ
	                |	торо_ПринятиеОРКУчетуСотрудники.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	Результат = Запрос.Выполнить();
	ВыборкаКомиссия = Результат.Выбрать();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("КомиссияШапка");
    ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Комиссия");
	Пока ВыборкаКомиссия.Следующий() Цикл
		 ОбластьМакета.Параметры.Сотрудник = ВыборкаКомиссия.Сотрудник;
		 ТабДокумент.Вывести(ОбластьМакета);		
	КонецЦикла;
		
КонецПроцедуры

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти
